<?php

use yii\db\Migration;

/**
 * Handles the creation of table `{{%pet_breed}}` and inserts initial data.
 */
class m250423_110100_create_pet_breed_table extends Migration
{
    public function safeUp()
    {
        $this->createTable('{{%pet_breed}}', [
            'id' => $this->primaryKey()->unsigned(),
            'pet_type_id' => $this->integer()->unsigned()->notNull(),
            'name_uk' => $this->string()->defaultValue(null),
            'name_en' => $this->string()->defaultValue(null),
            'name_ru' => $this->string()->defaultValue(null),
            'created_at' => $this->timestamp()->defaultValue(null),
            'updated_at' => $this->timestamp()->defaultValue(null),
        ]);

        $this->createIndex(
            'idx-pet_breed-pet_type_id',
            '{{%pet_breed}}',
            'pet_type_id'
        );

        $this->addForeignKey(
            'fk-pet_breed-pet_type_id',
            '{{%pet_breed}}',
            'pet_type_id',
            '{{%pet_type}}',
            'id',
            'RESTRICT',
            'CASCADE'
        );

        $this->batchInsert('{{%pet_breed}}', [
            'id', 'pet_type_id', 'name_uk', 'name_en', 'name_ru', 'created_at', 'updated_at'
        ], [
            [1, 1, 'Німецька вівчарка', 'German Shepherd', 'Немецкая овчарка', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [2, 1, 'Лабрадор ретрівер', 'Labrador Retriever', 'Лабрадор ретривер', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [3, 1, 'Золотистий ретрівер', 'Golden Retriever', 'Золотистый ретривер', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [4, 1, 'Французький бульдог', 'French Bulldog', 'Французский бульдог', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [5, 1, 'Йоркширський терʼєр', 'Yorkshire Terrier', 'Йоркширский терьер', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [6, 1, 'Доберман', 'Doberman', 'Доберман', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [7, 1, 'Такса', 'Dachshund', 'Такса', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [8, 1, 'Сибірський хаскі', 'Siberian Husky', 'Сибирский хаски', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [9, 1, 'Чихуахуа', 'Chihuahua', 'Чихуахуа', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [10, 1, 'Мопс', 'Pug', 'Мопс', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [11, 1, 'Ротвейлер', 'Rottweiler', 'Ротвейлер', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [12, 1, 'Боксер', 'Boxer', 'Боксер', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [13, 1, 'Акіта-іну', 'Akita Inu', 'Акита-ину', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [14, 1, 'Кокер-спанієль', 'Cocker Spaniel', 'Кокер-спаниель', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [15, 1, 'Шпіц', 'Spitz', 'Шпиц', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [16, 1, 'Алабай', 'Alabai', 'Алабай', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [17, 2, 'Перська кішка', 'Persian Cat', 'Персидская кошка', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [18, 2, 'Сіамська кішка', 'Siamese Cat', 'Сиамская кошка', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [19, 2, 'Мейн-кун', 'Maine Coon', 'Мейн-кун', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [20, 2, 'Британська короткошерста', 'British Shorthair', 'Британская короткошёрстная', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [21, 2, 'Бенгальська кішка', 'Bengal Cat', 'Бенгальская кошка', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [22, 2, 'Шотландська висловуха', 'Scottish Fold', 'Шотландская вислоухая', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [23, 2, 'Російська блакитна', 'Russian Blue', 'Русская голубая', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [24, 2, 'Сфінкс', 'Sphynx', 'Сфинкс', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [25, 2, 'Абіссінська кішка', 'Abyssinian Cat', 'Абиссинская кошка', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [26, 2, 'Рагдолл', 'Ragdoll', 'Рэгдолл', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [27, 2, 'Орієнтальна кішка', 'Oriental Cat', 'Ориентальная кошка', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [28, 2, 'Американський керл', 'American Curl', 'Американский керл', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [29, 2, 'Тойгер', 'Toyger', 'Тойгер', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [30, 2, 'Селкірк-рекс', 'Selkirk Rex', 'Селкирк-рекс', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [31, 2, 'Невська маскарадна', 'Neva Masquerade', 'Невская маскарадная', '2025-03-12 03:15:20', '2025-03-12 03:15:20'],
            [32, 2, 'Японський бобтейл', 'Japanese Bobtail', 'Японский бобтейл', '2025-03-12 03:15:20', '2025-03-12 03:15:20']
        ]);
    }

    public function safeDown()
    {
        $this->dropForeignKey(
            'fk-pet_breed-pet_type_id',
            '{{%pet_breed}}'
        );

        $this->dropIndex(
            'idx-pet_breed-pet_type_id',
            '{{%pet_breed}}'
        );

        $this->dropTable('{{%pet_breed}}');
    }
}
